In [1]:
import mysql.connector
import pandas as pd

In [2]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'root',
    database = 'retrowheels'
)

In [3]:
mycursor = mydb.cursor()
def sql_df(yourQuery):
    mycursor.execute(yourQuery)
    myresult = mycursor.fetchall()
    df = pd.DataFrame(myresult, columns=mycursor.column_names)
    return df

In [5]:
sql_df(
    'select count(distinct customername) as customer,count(distinct city) as city,count(distinct country) as countries from customers;'
)

   customer  city  countries
0       122    95         27

In [7]:
sql_df(
    'SELECT (SELECT COUNT(EMPLOYEENUMBER) FROM EMPLOYEES) AS EMPLOYEES, (SELECT COUNT(OFFICECODE) FROM OFFICES) AS OFFICE, (SELECT COUNT(DISTINCT COUNTRY) FROM OFFICES) AS COUNTRY, (SELECT COUNT(DISTINCT PRODUCTNAME) FROM PRODUCTS) AS PRODUCTS, (SELECT SUM(QUANTITYINSTOCK) FROM PRODUCTS) AS STOCKPRODUCT, (SELECT COUNT(DISTINCT PRODUCTVENDOR) FROM PRODUCTS) AS VENDORS;'
)

   EMPLOYEES  OFFICE  COUNTRY  PRODUCTS STOCKPRODUCT  VENDORS
0         23       7        5       110       555131       13

In [8]:
sql_df(
    'SELECT DISTINCT PRODUCTLINE, MIN(BUYPRICE) AS MINPRICE, MAX(BUYPRICE) AS MAXPRICE FROM PRODUCTS GROUP BY PRODUCTLINE;'
)

        PRODUCTLINE MINPRICE MAXPRICE
0      Classic Cars    15.91   103.42
1       Motorcycles    24.14    91.02
2            Planes    29.34    77.27
3             Ships    33.30    82.34
4            Trains    26.72    67.56
5  Trucks and Buses    24.92    84.76
6      Vintage Cars    20.61    86.70

In [9]:
sql_df(
    'SELECT CUSTOMERNAME, CITY, COUNTRY, SUM(AMOUNT) AS TOTAL FROM CUSTOMERS, PAYMENTS WHERE CUSTOMERS.CUSTOMERNUMBER = PAYMENTS.CUSTOMERNUMBER GROUP BY CUSTOMERS.CUSTOMERNUMBER ORDER BY TOTAL DESC LIMIT 10;'
)

                   CUSTOMERNAME           CITY      COUNTRY      TOTAL
0        Euro+ Shopping Channel         Madrid        Spain  715738.98
1  Mini Gifts Distributors Ltd.     San Rafael          USA  584188.24
2    Australian Collectors, Co.      Melbourne    Australia  180585.07
3            Muscle Machine Inc            NYC          USA  177913.95
4       Dragon Souveniers, Ltd.      Singapore    Singapore  156251.03
5    Down Under Souveniers, Inc     Auckland    New Zealand  154622.08
6                AV Stores, Co.     Manchester           UK  148410.09
7       Anna's Decorations, Ltd   North Sydney    Australia  137034.22
8      Corporate Gift Ideas Co.  San Francisco          USA  132340.78
9        Saveley & Henriot, Co.           Lyon       France  130305.35